<?php
/** .-------------------------------------------------------------------
 * |    Software: []
 * | Description:
 * |        Site: www.jechorn.cn
 * |-------------------------------------------------------------------
 * |      Author: 王志传
 * |      Email : <jechorn@163.com>
 * |  CreateTime: 2017/8/6-11:27
 * | Copyright (c) 2016-2019, www.jechorn.cn. All Rights Reserved.
 * '-------------------------------------------------------------------*/

// ***************************************************
//                     分割线
// ****************************************************

/**  ---------------------------------------------------------
 * |  下面是链接数据库的详细配置信息，请根据你的你索要操作的数据库就行详细的配置
 * |  ps: 数据库类型默认是mysql,请不要随意修改
 * |  ps: 数据库主机名：本地的话一般是localhost或者127.0.0.1
 * |  ps:数据库用户名 mysql默认是root,密码为空，请根据你的实际情况进行设置
 * |-------------------------------------------------------------*/
$dbms = 'mysql';     //数据库类型
$host = 'localhost'; //数据库主机名
$dbName = 'data';    //使用的数据库
$user = 'root';      //数据库连接用户名
$pass = '';          //对应的密码
// $dsn 不用修改
$dsn = "$dbms:host=$host;dbname=$dbName";

// ***************************************************
//                     分割线
// ****************************************************

/**  ---------------------------------------------------------
 * |  这里是设置你的表字段名称以及数据表的名称
 * |  ps: 数据表的字段请按照csv文件中表头的字段顺序就行设置，要不将会导致数据导入存在问题。
 * |  ps:数据表字段的设置实例 ['statistic_time','ap_mac']
 * |  ps:请注意数组中的逗号为英文字符中逗号,单引号也是英文字符中的单引号,务必注意
 * |-------------------------------------------------------------*/

$tableName = 'ap_daily'; //需要插入的数据表的名称
$dirName = 'daily';   //csv存放的目录，必须在该文件同级的data文件夹里面新建

//数据表的字段名称
$tableField = ['statistics_time', 'broadband_account', 'city', 'industry', 'businessman_id', 'businessman_name', 'install_address', 'ap_mac', 'is_match', 'ssid', 'login_page_uv','success_page_uv','login_page_pv','success_page_pv','pv_http','is_active_ap','is_online_ap','portal_lever','process_time','access_number','partner','match_time','ap_version_number','ap_type'];




// ***************************************************
//                     分割线
// ****************************************************

require_once './dist/import.php';

