<?php
/** .-------------------------------------------------------------------
 * |    Software: []
 * | Description:
 * |        Site: www.jechorn.cn
 * |-------------------------------------------------------------------
 * |      Author: 王志传
 * |      Email : <jechorn@163.com>
 * |  CreateTime: 2017/8/11-7:33
 * | Copyright (c) 2016-2019, www.jechorn.cn. All Rights Reserved.
 * '-------------------------------------------------------------------*/

// ***************************************************
//                     分割线
// ****************************************************

/**  ---------------------------------------------------------
 * |  下面是链接数据库的详细配置信息，请根据你的你索要操作的数据库就行详细的配置
 * |  ps: 数据库类型默认是mysql,请不要随意修改
 * |  ps: 数据库主机名：本地的话一般是localhost或者127.0.0.1
 * |  ps:数据库用户名 mysql默认是root,密码为空，请根据你的实际情况进行设置
 * |-------------------------------------------------------------*/

$dbms = 'mysql';     //数据库类型
$host = 'localhost'; //数据库主机名
$dbName = 'report';    //使用的数据库
$user = 'root';      //数据库连接用户名
$pass = '';          //对应的密码
// $dsn 不用修改
$dsn = "$dbms:host=$host;dbname=$dbName";